{
  "name": "Venkata Sai Yakkshit Reddy Asodi",
  "location": "Berlin, Germany",
  "phone": "+91 9493006444",
  "email": "saiyakkshit2001@gmail.com",
  "linkedin": "https://linkedin.com/in/yakkshit",
  "website": "https://yakkshit.com",
  "summary": "Passionate and results-driven Software Developer with extensive experience in developing high-quality, scalable software solutions. Expertise in full product lifecycle management, with a strong focus on automation, authentication, databases, and microservices. Proficient in cloud services like GCP and tools such as Kubernetes, Docker, and CI/CD pipelines. Proven ability to implement Agile methodologies, delivering robust and efficient software solutions. Committed to continuous learning and contributing to the open-source community.",
  "skills": [
    "Deployment & Automation: Kubernetes, Docker, Bash Scripting, Terraform, GitHub Actions",
    "Frameworks: Django, React, Flutter, Langchain, Next.js",
    "Languages: Python, Java, JavaScript, TypeScript, Go, SQL, PHP, HTML",
    "Tools & Technologies: Git, Jenkins, Selenium, GCP, Microservices, Cloud CLI, Vertex AI, LLMS (GPT-4, Ollama, Gemini)"
  ],
  "experience": [
    {
      "company": "Spoki",
      "position": "Software Developer",
      "duration": "January 2024 – May 2024",
      "location": "Remote/Italy",
      "description": "Developed software integration between Spoki and Magento, ensuring project completion with high quality. Collaborated with cross-functional teams, demonstrating strong technical skills and professionalism."
    },
    {
      "company": "Circleup",
      "position": "Co-Founder/Lead Full Stack Engineer",
      "duration": "December 2023 – Present",
      "location": "Zurich, Switzerland",
      "description": "Led the development of React and Flutter applications with Django backend. Built a RAG-based automation agent using Langchain and Vertex AI. Enhanced application quality through effective debugging, issue resolution, and code optimization. Delivered high-quality software in Agile sprints."
    },
    {
      "company": "GatewayD",
      "position": "Full Stack Engineer",
      "duration": "November 2023 – January 2024",
      "location": "Stockholm, Sweden",
      "description": "Implemented automated plugin installation and developed API metrics for the latest release. Focused on bug fixes and enhancing project performance and reliability."
    },
    {
      "company": "CEDZLABS",
      "position": "Full Stack Engineer/Application Developer",
      "duration": "May 2021 – June 2023",
      "location": "India",
      "description": "Developed and maintained web applications using Django and RESTful APIs. Monitored and optimized website performance using Google Analytics and Firebase SDK. Developed cross-platform mobile applications using Flutter. Integrated machine learning models with TensorFlow Lite and designed user interfaces with Adobe XD."
    }
  ],
  "projects": [
    {
      "name": "AI Resume Tuner/Designer",
      "description": "Created an AI-powered resume tuner application based on job descriptions. Built using Next.js for the frontend and RAG, Langchain, Vertex AI, and LLMS (GPT-4, Ollama, Gemini) to generate resumes tailored to uploaded career data."
    },
    {
      "name": "COVID-19 News Alert",
      "description": "Developed an iOS app providing real-time COVID-19 case notifications. Integrated APIs and partnered with health organizations to deliver accurate information."
    },
    {
      "name": "CO2 Monitoring System",
      "description": "Created an air quality monitor using ESP32 microcontroller and sensors. Implemented MQTT connectivity for real-time monitoring."
    },
    {
      "name": "Langversation",
      "description": "Developed a multilingual chat app with end-to-end encryption. Integrated FirebaseStorage, FirebaseAuthentication, and ML Kit for language translation."
    },
    {
      "name": "AWS Hosting and Serverless Functions",
      "description": "Implemented secure file encryption on AWS and developed a scalable website using NextJS and Three.js with automated deployment."
    }
  ],
  "education": [
    {
      "institution": "Blekinge Institute of Technology",
      "degree": "Master of Science in Computer Science",
      "duration": "September 2022 – June 2023",
      "gpa": "3.5/4"
    },
    {
      "institution": "University College of Engineering JNTUK",
      "degree": "Bachelor of Science in Computer Science",
      "duration": "August 2019 – June 2022",
      "gpa": "3.0/4"
    }
  ],
  "certificates": [
    "Microsoft Technical Associate (MTA) - Python",
    "Microsoft Technical Associate (MTA) - Java",
    "AI Internship at Verzeo Inc.",
    "Skill Badges - Google Cloud Career Path",
    "Data Visualization with R - IBM",
    "Database Operations in MariaDB Using Python - Infosys",
    "Introduction to Generative AI - Google",
    "Introduction to Large Language Models - Google",
    "Python for Data Science - IBM",
    "Azure: Create a REST API using NodeJS Serverless Functions"
  ],
  "leadership": [
    "Led a team of 30+ members in the CedzLabs community, focusing on service, collaboration, and academic excellence.",
    "Contributed to Kubernetes by enhancing the release process, including dependency checks and release note generation.",
    "Implemented upgrade logic for MicroK8s clusters, ensuring smooth updates and stability.",
    "Extensive experience in Agile methodologies, including Scrum and Kanban, to drive successful project outcomes."
  ]
}
